app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'venturinierie@gmail.com'
 LIMIT 1
---
    public function registerUser()
{
    $session = session();
    $userModel = new UserModel();

    // Obtener datos del formulario
    $data = [
        'username' => $this->request->getPost('username'),
        'email' => $this->request->getPost('email'),
        'password' => $this->request->getPost('password'),
        'is_active' => 0, // Cuenta inactiva hasta confirmación
        'created_at' => date('Y-m-d H:i:s')
    ];

    // Verificar si el email ya existe
    if ($userModel->where('email', $data['email'])->first()) {

SELECT *
FROM `users`
WHERE `email` = 'erieventurini@alumnos.itr3.edu.ar'
 LIMIT 1
---
    public function loginUser()
    {
        $userModel = new UserModel();
        $session = session();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();

SELECT *
FROM `skate`
WHERE `ID_usuario` = '85'
---
    public function listSkates()
    {
        $session = session();

        if ($session->get('logged_in')) {
            $userId = $session->get('user_id');
            $skateModel = new SkateModel();

            // Obtener solo los skates asociados al ID del usuario
            try {
                $skates = $skateModel->where('ID_usuario', $userId)->findAll();

SELECT *
FROM `direccion`
WHERE `ID_usuario` = '85'
SELECT *
FROM `provincias`
WHERE `provincias`.`id` = '7'
---
public function comprar($precio = 0)
{
    $session = session();

    // Verificar que el usuario está logueado
    if (!$session->get('logged_in')) {
        // Guardar la URL de redirección en sesión antes de enviar al login
        $session->set('redirect_url', current_url());
        return redirect()->to('/login')->with('error', 'Debes iniciar sesión para realizar una compra');
    }

    // Obtener el ID del usuario
    $userId = $session->get('user_id');

    // Obtener las direcciones asociadas a este usuario
    $direccionModel = new DireccionModel();
    $userAddresses = $direccionModel->where('ID_usuario', $userId)->findAll();

    // Verificar si hay direcciones
    if (empty($userAddresses)) {
        $session->setFlashdata('error', 'No tienes direcciones registradas.');
        return redirect()->to('nuevadireccion');  // Redirigir a la página de registrar nueva dirección
    }

    // Obtener las provincias y localidades
    $provinciaModel = new ProvinciaModel();
    $localidadModel = new LocalidadModel();

    foreach ($userAddresses as &$address) {
        // Obtener nombre de la provincia y localidad usando sus IDs
        $provincia = $provinciaModel->find($address['ID_provincia']);

SELECT *
FROM `users`
WHERE `users`.`id` = '85'
UPDATE `users` SET `username` = 'santiago12'
WHERE `users`.`id` IN ('85')
---
public function updateUserProfile()
{
    $session = session();
    $userModel = new UserModel();
    $userId = $session->get('user_id');
    $currentUser = $userModel->find($userId);

    if (!$session->get('logged_in') || !$currentUser) {
        return redirect()->to('/login')->with('error', 'Debes iniciar sesión para actualizar tu perfil');
    }

    $username = $this->request->getPost('username');
    $newEmail = $this->request->getPost('email');
    $newPassword = $this->request->getPost('new_password');
    $currentPassword = $this->request->getPost('current_password');

    if (!$userModel->verifyPassword($currentUser['email'], $currentPassword)) {
        return redirect()->back()->with('error', 'La contraseña actual es incorrecta');
    }

    // Procesar cambio de username
    if ($username && $username !== $currentUser['username']) {
        try {
            $userModel->update($userId, ['username' => $username]);

SELECT *
FROM `users`
WHERE `users`.`id` = '85'
---
public function profile()
{
    $session = session();

    if (!$session->get('logged_in')) {
        return redirect()->to('/login')->with('error', 'Debes iniciar sesión para ver tu perfil');
    }

    $userModel = new UserModel();
    $user = $userModel->find($session->get('user_id'));