app/Controllers/SkateController.php

UPDATE `skate` SET `velocidad` = 0, `bateria` = 90, `temperatura` = 26.3, `ID_ubicacion` = 1
WHERE `codigo` = 'YYYYY1'
---
        ];

        // Usar where para asegurarse de que se actualice usando el campo "codigo"
        if ($this->skateModel->where('codigo', $codigo)->set($updateData)->update()) {

UPDATE `ubicacion` SET `longitud` = -64.12705, `latitud` = -32.17378, `hora` = '20:12:26'
WHERE `ID_ubicacion` = 1
---
            ];

            // Realizar el update de la ubicación usando el ID_ubicacion
            if ($ubicacionModel->where('ID_ubicacion', $ID_ubicacion)->set($ubicacionData)->update()) {