app/Models/SkateModel.php

SELECT *
FROM `skate`
WHERE `codigo` = 'YYYYY1'
 LIMIT 1
---
    public function getSkateByCode($codigo)
    {
        return $this->where('codigo', $codigo)->first();

SELECT *
FROM `skate`
WHERE `codigo` = 'YYYYY1'
 LIMIT 1
---
    public function getSkateWithLocation($codigo)
    {
        // Ahora no es necesario hacer un join, ya que los datos de ubicación están en la tabla skate
        return $this->where('codigo', $codigo)->first();