app/Models/UserModel.php

    public function findUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'venturinierie@gmail.com'
 LIMIT 1

    public function setPasswordResetToken($email, $token, $expiration)
    {
        return $this->where('email', $email)
                    ->set('reset_token', $token)
                    ->set('reset_expiration', $expiration)
                    ->update();
---
UPDATE `users` SET `reset_token` = 'b306ae3f73608978fed6d680698c4750', `reset_expiration` = '2025-10-17 15:42:39'
WHERE `email` = 'santizerbini3@gmail.com'

    public function verifyToken($token)
    {
        return $this->where('reset_token', $token)
                    ->where('reset_expiration >=', date('Y-m-d H:i:s'))
                    ->first();
---
SELECT *
FROM `users`
WHERE `reset_token` = 'e84323'
AND `reset_expiration` >= '2024-09-17 22:36:15'
 LIMIT 1

    public function resetPassword($token, $newPassword)
    {
        // Hashea la nueva contraseña
        $hashedPassword = password_hash($newPassword, PASSWORD_DEFAULT);

        return $this->where('reset_token', $token)
                    ->set('password', $hashedPassword) // Almacena la contraseña hasheada
                    ->set('reset_token', null)
                    ->set('reset_expiration', null)
                    ->update();
---
UPDATE `users` SET `password` = '$2y$10$/AOJOol1EpTzBpJ5kAkoeubjgX..Q9suPydGB9jhb/kOrVyIZMNne', `reset_token` = NULL, `reset_expiration` = NULL
WHERE `reset_token` = 'e84323'